; domain
(define (domain liftedtcore_blocksworld-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality :conditional-effects :action-costs)
 (:types block)
 (:constants
   purple_block_1 black_block_1 yellow_block_2 yellow_block_1 grey_block_1 - block
 )
 (:predicates (clear ?obj - block) (ontable ?obj - block) (handempty) (holding ?obj - block) (on ?obj1 - block ?obj2 - block) (hold_0) (hold_1) (hold_2) (hold_3) (hold_4) (seen_psi_5))
 (:functions (total-cost))
 (:action pickup
  :parameters ( ?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty) (not (and (ontable purple_block_1) (not (= ?obj purple_block_1)))) (or (not (and (ontable black_block_1) (not (= ?obj black_block_1)))) (seen_psi_5)))
  :effect (and (holding ?obj) (not (clear ?obj)) (not (ontable ?obj)) (not (handempty)) (when (and (not (and (ontable yellow_block_2) (not (= ?obj yellow_block_2)))) (not (and (ontable yellow_block_1) (not (= ?obj yellow_block_1))))) (hold_0)) (when (or (not (and (ontable yellow_block_1) (not (= ?obj yellow_block_1)))) (= ?obj yellow_block_1) (holding yellow_block_1)) (hold_1)) (when (and (ontable grey_block_1) (not (= ?obj grey_block_1))) (hold_2)) (when (and (ontable grey_block_1) (not (= ?obj grey_block_1)) (not (or (on purple_block_1 yellow_block_2) (= ?obj yellow_block_2) (holding yellow_block_2)))) (not (hold_3))) (when (or (on purple_block_1 yellow_block_2) (= ?obj yellow_block_2) (holding yellow_block_2)) (hold_3)) (when (and (ontable black_block_1) (not (= ?obj black_block_1))) (hold_4)) (when (or (on purple_block_1 grey_block_1) (not (and (ontable yellow_block_1) (not (= ?obj yellow_block_1))))) (seen_psi_5)) (increase (total-cost) 1)))
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj) (not (or (= ?obj purple_block_1) (ontable purple_block_1))) (or (not (or (= ?obj black_block_1) (ontable black_block_1))) (seen_psi_5)))
  :effect (and (clear ?obj) (handempty) (ontable ?obj) (not (holding ?obj)) (when (and (not (or (= ?obj yellow_block_2) (ontable yellow_block_2))) (not (or (= ?obj yellow_block_1) (ontable yellow_block_1)))) (hold_0)) (when (or (not (or (= ?obj yellow_block_1) (ontable yellow_block_1))) (and (holding yellow_block_1) (not (= ?obj yellow_block_1)))) (hold_1)) (when (or (= ?obj grey_block_1) (ontable grey_block_1)) (hold_2)) (when (and (or (= ?obj grey_block_1) (ontable grey_block_1)) (not (or (on purple_block_1 yellow_block_2) (and (holding yellow_block_2) (not (= ?obj yellow_block_2)))))) (not (hold_3))) (when (or (on purple_block_1 yellow_block_2) (and (holding yellow_block_2) (not (= ?obj yellow_block_2)))) (hold_3)) (when (or (= ?obj black_block_1) (ontable black_block_1)) (hold_4)) (when (or (on purple_block_1 grey_block_1) (not (or (= ?obj yellow_block_1) (ontable yellow_block_1)))) (seen_psi_5)) (increase (total-cost) 1)))
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj))
  :effect (and (handempty) (clear ?obj) (on ?obj ?underobj) (not (clear ?underobj)) (not (holding ?obj)) (when (or (not (ontable yellow_block_1)) (and (holding yellow_block_1) (not (= ?obj yellow_block_1)))) (hold_1)) (when (and (ontable grey_block_1) (not (or (and (= ?obj purple_block_1) (= ?underobj yellow_block_2)) (on purple_block_1 yellow_block_2) (and (holding yellow_block_2) (not (= ?obj yellow_block_2)))))) (not (hold_3))) (when (or (and (= ?obj purple_block_1) (= ?underobj yellow_block_2)) (on purple_block_1 yellow_block_2) (and (holding yellow_block_2) (not (= ?obj yellow_block_2)))) (hold_3)) (when (or (and (= ?obj purple_block_1) (= ?underobj grey_block_1)) (on purple_block_1 grey_block_1) (not (ontable yellow_block_1))) (seen_psi_5)) (increase (total-cost) 1)))
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty))
  :effect (and (holding ?obj) (clear ?underobj) (not (on ?obj ?underobj)) (not (clear ?obj)) (not (handempty)) (when (or (not (ontable yellow_block_1)) (= ?obj yellow_block_1) (holding yellow_block_1)) (hold_1)) (when (and (ontable grey_block_1) (not (or (and (on purple_block_1 yellow_block_2) (not (and (= ?obj purple_block_1) (= ?underobj yellow_block_2)))) (= ?obj yellow_block_2) (holding yellow_block_2)))) (not (hold_3))) (when (or (and (on purple_block_1 yellow_block_2) (not (and (= ?obj purple_block_1) (= ?underobj yellow_block_2)))) (= ?obj yellow_block_2) (holding yellow_block_2)) (hold_3)) (when (or (and (on purple_block_1 grey_block_1) (not (and (= ?obj purple_block_1) (= ?underobj grey_block_1)))) (not (ontable yellow_block_1))) (seen_psi_5)) (increase (total-cost) 1)))
)

; problem
(define (problem liftedtcore_blocksworld-problem)
 (:domain liftedtcore_blocksworld-domain)
 (:objects
 )
 (:init (ontable yellow_block_1) (ontable grey_block_1) (on black_block_1 grey_block_1) (ontable yellow_block_2) (on purple_block_1 yellow_block_2) (clear yellow_block_1) (clear black_block_1) (clear purple_block_1) (handempty) (hold_2) (hold_3) (= (total-cost) 0))
 (:goal (and (on grey_block_1 yellow_block_2) (hold_0) (hold_1) (hold_2) (hold_3) (hold_4)))
 (:metric minimize (total-cost))
)

; plan
1. (pickup yellow_block_1)
   deleted: (clear yellow_block_1) (ontable yellow_block_1) (handempty)
   added: (holding yellow_block_1) (hold_1) (seen_psi_5)
   goals met: 3 of 6
2. (putdown yellow_block_1)
   deleted: (holding yellow_block_1)
   added: (clear yellow_block_1) (handempty) (ontable yellow_block_1)
   goals met: 3 of 6
3. (unstack black_block_1 grey_block_1)
   deleted: (on black_block_1 grey_block_1) (clear black_block_1) (handempty)
   added: (holding black_block_1) (clear grey_block_1)
   goals met: 3 of 6
4. (putdown black_block_1)
   deleted: (holding black_block_1)
   added: (clear black_block_1) (handempty) (ontable black_block_1) (hold_4)
   goals met: 4 of 6
5. (unstack purple_block_1 yellow_block_2)
   deleted: (on purple_block_1 yellow_block_2) (clear purple_block_1) (handempty) (hold_3)
   added: (holding purple_block_1) (clear yellow_block_2)
   goals met: 3 of 6
6. (stack purple_block_1 black_block_1)
   deleted: (clear black_block_1) (holding purple_block_1)
   added: (handempty) (clear purple_block_1) (on purple_block_1 black_block_1)
   goals met: 3 of 6
7. (pickup grey_block_1)
   deleted: (clear grey_block_1) (ontable grey_block_1) (handempty)
   added: (holding grey_block_1)
   goals met: 3 of 6
8. (stack grey_block_1 yellow_block_1)
   deleted: (clear yellow_block_1) (holding grey_block_1)
   added: (handempty) (clear grey_block_1) (on grey_block_1 yellow_block_1)
   goals met: 3 of 6
9. (pickup yellow_block_2)
   deleted: (clear yellow_block_2) (ontable yellow_block_2) (handempty)
   added: (holding yellow_block_2) (hold_3)
   goals met: 4 of 6
10. (stack yellow_block_2 purple_block_1)
   deleted: (clear purple_block_1) (holding yellow_block_2)
   added: (handempty) (clear yellow_block_2) (on yellow_block_2 purple_block_1)
   goals met: 4 of 6
11. (unstack grey_block_1 yellow_block_1)
   deleted: (on grey_block_1 yellow_block_1) (clear grey_block_1) (handempty)
   added: (holding grey_block_1) (clear yellow_block_1)
   goals met: 4 of 6
12. (stack grey_block_1 yellow_block_2)
   deleted: (clear yellow_block_2) (holding grey_block_1)
   added: (handempty) (clear grey_block_1) (on grey_block_1 yellow_block_2)
   goals met: 5 of 6
13. (pickup yellow_block_1)
   deleted: (clear yellow_block_1) (ontable yellow_block_1) (handempty)
   added: (holding yellow_block_1) (hold_0)
   goals met: 6 of 6
